app/controllers/bears_controller.rb

  def create
    @bear = Bear.new(bear_params)

    if @bear.save
---
INSERT INTO "bears" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sam"], ["description", "rarr"], ["created_at", "2016-02-01 16:43:08.764862"], ["updated_at", "2016-02-01 16:43:08.764862"]]

  def show
    @bear = Bear.find(params[:id])
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @bears = Bear.all
---
SELECT "bears".* FROM "bears"

  def edit
    @bear =  Bear.find(params[:id])
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @bear = Bear.find(params[:id])

    if @bear.update(bear_params)
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "bears" SET "description" = ?, "updated_at" = ? WHERE "bears"."id" = ?  [["description", "rarr2"], ["updated_at", "2016-02-01 16:47:40.867857"], ["id", 2]]

  def destroy
    @bear =  Bear.find(params[:id])
    @bear.destroy
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "bears" WHERE "bears"."id" = ?  [["id", 1]]